import { generatePosts } from './generate-posts.js';
import { drawMiniatures } from './draw-miniatures.js';
import { initViewPost, openPostModal } from './view-post.js';

const posts = generatePosts();

drawMiniatures(posts, openPostModal);
initViewPost();

/*
 * Баг 06.03.2024
 * Если ранее модальное окно было прокручено вниз, то при скрытии и показе заново прокрутка не возвращаеться вверх.
 * Нужно найти способ прокрутить доверху модалье окно, а не саму страницу.
 *
 * + Баг 06.03.2024 - draw-miniatures.js - строка  evt.currentTarget.blur();
 * css .picture:hover .picture__info
 * Когда открыто модальное окно, то на нажатой картике остаеться элемент с количеством лайком и коментариев, отображаеться при наведении указателя мыши.
 * Он пропадает когда происходит еще один клик в модальном окне или выключенной части страницы.
 * Сделать либо, чтобы не пропадал, либо пропадал сразу при появлении модального окна.
 * добавил 07.03.2024, после зактыия он остаеться и не скрываеться когда перемещаешь мышь на другую картинку и отображаються сразу две
 *
 * Поробовать реализорвать:
 * Кнопка для загрузки новой порции комментариев === прокрутка до самого низу.
 *
 * ------------------------
 * ------------------------
 * ------------------------
 */
