import './draw-miniatures.js';
import './view-post.js';

/*
 * Баг 06.03.2024
 * Если ранее модальное окно было прокручено вниз, то при скрытии и показе заново прокрутка не возвращаеться вверх.
 * Нужно найти способ прокрутить доверху модалье окно, а не саму страницу.
 *
 * Баг 06.03.2024
 * Когда открыто модальное окно, то на нажатой картике остаеться элемент с количеством лайком и коментариев, отображаеться при наведении указателя мыши.
 * Он пропадает когда происходит еще один клик в модальном окне или выключенной части страницы.
 * Сделать либо, чтобы не пропадал, либо пропадал сразу при появлении модального окна.
 *
 * Поробовать реализорвать:
 * Кнопка для загрузки новой порции комментариев === прокрутка до самого низу.
 */
