import { generatePosts } from './generate-posts.js';
import { drawPictures } from './draw-pictures.js';
import { initBigPictureModal, openBigPictureModal } from './view-post/index.js';
import { initNewPost } from './new-post/index.js';

const posts = generatePosts();

drawPictures(posts, openBigPictureModal);
initBigPictureModal();
initNewPost();

/*
 * + Баг 06.03.2024 / возможно будет мешать автотестам
 * Если ранее модальное окно было прокручено вниз, то при скрытии и показе заново прокрутка не возвращаеться вверх.
 * Нужно найти способ прокрутить доверху модалье окно, а не саму страницу.
 *
 * + Баг 06.03.2024 - draw-miniatures.js - строка  evt.currentTarget.blur();
 * css .picture:hover .picture__info
 * Когда открыто модальное окно, то на нажатой картике остаеться элемент с количеством лайком и коментариев, отображаеться при наведении указателя мыши.
 * Он пропадает когда происходит еще один клик в модальном окне или выключенной части страницы.
 * Сделать либо, чтобы не пропадал, либо пропадал сразу при появлении модального окна.
 * добавил 07.03.2024, после зактыия он остаеться и не скрываеться когда перемещаешь мышь на другую картинку и отображаються сразу две
 *
 * Баг 12.03.2024
 * Если в модальном окне, что то выделить и потом закрыть по esc, то выделение остаеться на следующее открытие.
 * выдение на "Нравится", "5 из 26 комментариев"
 *
 * Поробовать реализорвать: возможно будет мешать автотестам
 * Кнопка для загрузки новой порции комментариев === прокрутка до самого низу.
 *
 * ------------------------
 * ------------------------
 * ------------------------
 */
